In [2]:
import pandas as pd
import numpy as np

In [9]:
from numpy.random import randn
np.random.seed(101)

In [3]:
labels = ["a", "b", "c"]
my_data = [10, 20, 30]
arr_data = np.array(my_data)
d = {"a":10, "b": 20, "c": 30}

## Panda Siries

In [4]:
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr_data,labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

## pandas Dataframe

In [31]:
df = pd.DataFrame(randn(5,4), ["A", "B", "C", "D", "E"], ["W", "X", "Y", "Z"])

In [14]:
df

          W         X         Y         Z
A  1.025984 -0.156598 -0.031579  0.649826
B  2.154846 -0.610259 -0.755325 -0.346419
C  0.147027 -0.479448  0.558769  1.024810
D -0.925874  1.862864 -1.133817  0.610478
E  0.386030  2.084019 -0.376519  0.230336

In [15]:
df["W"]

A    1.025984
B    2.154846
C    0.147027
D   -0.925874
E    0.386030
Name: W, dtype: float64

In [17]:
type(df["W"])

pandas.core.series.Series

In [18]:
df[["W", "Y"]]

          W         Y
A  1.025984 -0.031579
B  2.154846 -0.755325
C  0.147027  0.558769
D -0.925874 -1.133817
E  0.386030 -0.376519

In [20]:
df["new"] = df["W"] + df["Z"]

In [21]:
df

          W         X         Y         Z       new
A  1.025984 -0.156598 -0.031579  0.649826  1.675810
B  2.154846 -0.610259 -0.755325 -0.346419  1.808428
C  0.147027 -0.479448  0.558769  1.024810  1.171837
D -0.925874  1.862864 -1.133817  0.610478 -0.315396
E  0.386030  2.084019 -0.376519  0.230336  0.616367

In [25]:
df.drop("new", axis=1, inplace=True)

In [26]:
df

          W         X         Y         Z
A  1.025984 -0.156598 -0.031579  0.649826
B  2.154846 -0.610259 -0.755325 -0.346419
C  0.147027 -0.479448  0.558769  1.024810
D -0.925874  1.862864 -1.133817  0.610478
E  0.386030  2.084019 -0.376519  0.230336

In [29]:
df.drop("E", inplace=True)

In [33]:
df

          W         X         Y         Z
A  0.681209  1.035125 -0.031160  1.939932
B -1.005187 -0.741790  0.187125 -0.732845
C -1.382920  1.482495  0.961458 -2.141212
D  0.992573  1.192241 -1.046780  1.292765
E -1.467514 -0.494095 -0.162535  0.485809

In [34]:
df.shape

(5, 4)

In [39]:
df.loc[["A", "B"], ["W", "Z"]]

          W         Z
A  0.681209  1.939932
B -1.005187 -0.732845

In [40]:
df.iloc[1:,2:]

          Y         Z
B  0.187125 -0.732845
C  0.961458 -2.141212
D -1.046780  1.292765
E -0.162535  0.485809

In [41]:
df

          W         X         Y         Z
A  0.681209  1.035125 -0.031160  1.939932
B -1.005187 -0.741790  0.187125 -0.732845
C -1.382920  1.482495  0.961458 -2.141212
D  0.992573  1.192241 -1.046780  1.292765
E -1.467514 -0.494095 -0.162535  0.485809

In [42]:
df > 0

       W      X      Y      Z
A   True   True  False   True
B  False  False   True  False
C  False   True   True  False
D   True   True  False   True
E  False  False  False   True

In [43]:
bool_df = df > 0
bool_df

       W      X      Y      Z
A   True   True  False   True
B  False  False   True  False
C  False   True   True  False
D   True   True  False   True
E  False  False  False   True

In [44]:
df[bool_df]

          W         X         Y         Z
A  0.681209  1.035125       NaN  1.939932
B       NaN       NaN  0.187125       NaN
C       NaN  1.482495  0.961458       NaN
D  0.992573  1.192241       NaN  1.292765
E       NaN       NaN       NaN  0.485809